app/controllers/devices_controller.rb

    def set_device
      @device = Device.find(params.expect(:id))
---
SELECT "devices".* FROM "devices" WHERE "devices"."id" = NULL LIMIT 1