app/controllers/travels_controller.rb

INSERT INTO "travels" ("created_at", "updated_at", "timestamp_begin", "timestamp_end", "device_id") VALUES ('2025-07-15 00:01:41.173559', '2025-07-15 00:01:41.173559', '2025-07-14 20:55:00', '2025-07-14 20:55:00', 1) RETURNING "id"
---
  def create
    @travel = Travel.new(travel_params)

    respond_to do |format|
      if @travel.save

SELECT "travels".* FROM "travels" WHERE "travels"."id" = 1 LIMIT 1
---
    def set_travel
      @travel = Travel.find(params.expect(:id))